In [7]:
%ls data

import pandas as pd

 C 드라이브의 볼륨: Windows
 볼륨 일련 번호: 0086-AFF6

 C:\Users\soomin\인프런_공공데이터분석\inflearn_lecture_opendata\data 디렉터리

2021-05-19  오후 10:36    <DIR>          .
2021-05-19  오후 10:36    <DIR>          ..
2020-03-05  오전 07:28             2,163 전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv
2020-03-05  오전 07:28           162,510 주택도시보증공사_전국 평균 분양가격(2019년 12월).csv
               2개 파일             164,673 바이트
               2개 디렉터리  319,846,367,232 바이트 남음

In [8]:
df_last = pd.read_csv("data/주택도시보증공사_전국 평균 분양가격(2019년 12월).csv", encoding="cp949")
df_last.shape  # (행,렬)순 출력

(4335, 5)

In [9]:
df_last.head()   # shift+tap : 도움말 보기 또는 .head ? :도움말 보기

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [10]:
df_last.tail()  #마지막 5개 tail로 미리보기 
                # NaN  not a number 결측치

     지역명               규모구분    연도   월 분양가격(㎡)
4330  제주                 전체  2019  12    3882
4331  제주         전용면적 60㎡이하  2019  12     NaN
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN
4334  제주        전용면적 102㎡초과  2019  12    3601

In [11]:
df_first = pd.read_csv("data/전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv", encoding="cp949")
df_first.head()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [12]:
df_first.tail()  #최근 데이터와 전혀 다른 모습 => 두개의 데이터 합쳐야 전체 분석 가능.

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,...,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580
13,전남,5678,5678,5678,5696,5736,5656,5609,5780,5685,...,5768,5784,5784,5833,5825,5940,6050,6243,6286,6289
14,경북,6168,6168,6234,6317,6412,6409,6554,6556,6563,...,6881,6989,6992,6953,6997,7006,6966,6887,7035,7037
15,경남,6473,6485,6502,6610,6599,6610,6615,6613,6606,...,7125,7332,7592,7588,7668,7683,7717,7715,7723,7665
16,제주,7674,7900,7900,7900,7900,7900,7914,7914,7914,...,7724,7739,7739,7739,7826,7285,7285,7343,7343,7343

In [13]:
df_last.info()  # 4335개의 인덱스 번호, 
                # 분양가격에 결측치 확인 가능.  object type-> 숫자형 변경

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.5+ KB

In [14]:
# isnull 을 통해 결측치를 봅니다. => true , false를 각각1,0으로 표현 

df_last.isnull().sum()  #결측치 수 구하기

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [15]:
df_last.isna().sum()  #로도 결측치 확인 가능

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [16]:
# df_last["분양가격(㎡)"].astype(int)  # value error 발생 -> 공백문자를 int로 변경 불가

df_last["분양가격"] = pd.to_numeric(df_last["분양가격(㎡)"], errors="coerce")  
#역시 value error -> shift+tap 옵션 확인 -> coerce 

df_last["분양가격"]  # dtype: float64 변경됨

0       5841.0
1       5652.0
2       5882.0
3       5721.0
4       5879.0
         ...
4330    3882.0
4331       NaN
4332    3898.0
4333       NaN
4334    3601.0
Name: 분양가격, Length: 4335, dtype: float64

In [17]:
df_first  #단위를 똑같이 만들어줄 필요가 있음
df_last["분양가격"]*3.3 # 평당 분양가격으로 컬럼 변경 : 전처리 -> 평당분양가격에 넣기
df_last["평당분양가격"] = df_last["분양가격"]*3.3
df_last.head(1)

  지역명 규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0  서울   전체  2015  10    5841  5841.0  19275.3

In [18]:
df_last.info() # 새로 생성한 컬럼의 데이터 타입 float으로 확인 가능

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
 5   분양가격     3957 non-null   float64
 6   평당분양가격   3957 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 237.2+ KB

In [19]:
df_last["분양가격(㎡)"].describe() # 기술통계값 한번에 확인 가능
#describe 을 요약하게 되면, 수치데이터가 아닐시, object타입(문자형태)을 요약하게 되므로,
# 밑의 수치데이터와 값이 다르게 나옴. 
# 공백문자가 있었기 때문에 coount 의 수 더 높음.

count     4058
unique    1753
top       2221
freq        17
Name: 분양가격(㎡), dtype: object

In [20]:
df_last["분양가격"].describe()  # 수치데이터의 기술통계 요약 확인 
#std 표준편차
#50% 중앙값
#max 값이 75%와 큰 차이 확인 가능
# *** mean과 중앙값의 차이를 확인 해야함 ***

count     3957.000000
mean      3238.128633
std       1264.309933
min       1868.000000
25%       2441.000000
50%       2874.000000
75%       3561.000000
max      12728.000000
Name: 분양가격, dtype: float64

In [21]:
df_last #규모구분 컬럼의 내용을 변경하는게 나아보임 -> 메모리 효율성 등을 위해서. 
df_last["규모구분"].unique()

array(['전체', '전용면적 60㎡이하', '전용면적 60㎡초과 85㎡이하', '전용면적 85㎡초과 102㎡이하',
       '전용면적 102㎡초과'], dtype=object)

In [22]:
df_last["전용면적"] =  df_last["규모구분"].str.replace("전용면적", "")
# pandas 에서 제공하는 str 메서드 사용 

df_last["전용면적"] = df_last["전용면적"].str.replace("초과", "~") 
df_last["전용면적"] = df_last["전용면적"].str.replace("이하" , "")
df_last["전용면적"] = df_last["전용면적"].str.replace(" ", "").str.strip() #앞뒤 공백제거까지
df_last["전용면적"]

0             전체
1            60㎡
2        60㎡~85㎡
3       85㎡~102㎡
4          102㎡~
          ...
4330          전체
4331         60㎡
4332     60㎡~85㎡
4333    85㎡~102㎡
4334       102㎡~
Name: 전용면적, Length: 4335, dtype: object

In [23]:
df_last.head(1)
df_last.info()  # memory usage: 271.1+ KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
 5   분양가격     3957 non-null   float64
 6   평당분양가격   3957 non-null   float64
 7   전용면적     4335 non-null   object
dtypes: float64(2), int64(2), object(4)
memory usage: 271.1+ KB

In [27]:
df_last = df_last.drop(["규모구분", "분양가격(㎡)"], axis=1)

     지역명    연도   월    분양가격   평당분양가격      전용면적
0     서울  2015  10  5841.0  19275.3        전체
1     서울  2015  10  5652.0  18651.6       60㎡
2     서울  2015  10  5882.0  19410.6   60㎡~85㎡
3     서울  2015  10  5721.0  18879.3  85㎡~102㎡
4     서울  2015  10  5879.0  19400.7     102㎡~
...   ..   ...  ..     ...      ...       ...
4330  제주  2019  12  3882.0  12810.6        전체
4331  제주  2019  12     NaN      NaN       60㎡
4332  제주  2019  12  3898.0  12863.4   60㎡~85㎡
4333  제주  2019  12     NaN      NaN  85㎡~102㎡
4334  제주  2019  12  3601.0  11883.3     102㎡~

[4335 rows x 6 columns]

In [28]:
df_last.head(1)

  지역명    연도   월    분양가격   평당분양가격 전용면적
0  서울  2015  10  5841.0  19275.3   전체